HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPort_bf.h
/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN27 */
#define IFX_P_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN27 */
#define IFX_P_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN27 */
#define IFX_P_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN28 */
#define IFX_P_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN28 */
#define IFX_P_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN28 */
#define IFX_P_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN29 */
#define IFX_P_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN29 */
#define IFX_P_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN29 */
#define IFX_P_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN2 */
#define IFX_P_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN2 */
#define IFX_P_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN2 */
#define IFX_P_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN30 */
#define IFX_P_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN30 */
#define IFX_P_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN30 */
#define IFX_P_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN31 */
#define IFX_P_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN31 */
#define IFX_P_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN31 */
#define IFX_P_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN3 */
#define IFX_P_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN3 */
#define IFX_P_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN3 */
#define IFX_P_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN4 */
#define IFX_P_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN4 */
#define IFX_P_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN4 */
#define IFX_P_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN5 */
#define IFX_P_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN5 */
#define IFX_P_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN5 */
#define IFX_P_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN6 */
#define IFX_P_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN6 */
#define IFX_P_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN6 */
#define IFX_P_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN7 */
#define IFX_P_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN7 */
#define IFX_P_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN7 */
#define IFX_P_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN8 */
#define IFX_P_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN8 */
#define IFX_P_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN8 */
#define IFX_P_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN9 */
#define IFX_P_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN9 */
#define IFX_P_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN9 */
#define IFX_P_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_P_ESR_Bits.EN0 */
#define IFX_P_ESR_EN0_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN0 */
#define IFX_P_ESR_EN0_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN0 */
#define IFX_P_ESR_EN0_OFF (0)

/** \\brief  Length for Ifx_P_ESR_Bits.EN10 */
#define IFX_P_ESR_EN10_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN10 */
#define IFX_P_ESR_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN10 */
#define IFX_P_ESR_EN10_OFF (10)

/** \\brief  Length for Ifx_P_ESR_Bits.EN11 */
#define IFX_P_ESR_EN11_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN11 */
#define IFX_P_ESR_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN11 */
#define IFX_P_ESR_EN11_OFF (11)

/** \\brief  Length for Ifx_P_ESR_Bits.EN12 */
#define IFX_P_ESR_EN12_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN12 */
#define IFX_P_ESR_EN12_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN12 */
#define IFX_P_ESR_EN12_OFF (12)

/** \\brief  Length for Ifx_P_ESR_Bits.EN13 */
#define IFX_P_ESR_EN13_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN13 */
#define IFX_P_ESR_EN13_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN13 */
#define IFX_P_ESR_EN13_OFF (13)

/** \\brief  Length for Ifx_P_ESR_Bits.EN14 */
#define IFX_P_ESR_EN14_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN14 */
#define IFX_P_ESR_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN14 */
#define IFX_P_ESR_EN14_OFF (14)

/** \\brief  Length for Ifx_P_ESR_Bits.EN15 */
#define IFX_P_ESR_EN15_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN15 */
#define IFX_P_ESR_EN15_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN15 */
#define IFX_P_ESR_EN15_OFF (15)

/** \\brief  Length for Ifx_P_ESR_Bits.EN1 */
#define IFX_P_ESR_EN1_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN1 */
#define IFX_P_ESR_EN1_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN1 */
#define IFX_P_ESR_EN1_OFF (1)

/** \\brief  Length for Ifx_P_ESR_Bits.EN2 */
#define IFX_P_ESR_EN2_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN2 */
#define IFX_P_ESR_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN2 */
#define IFX_P_ESR_EN2_OFF (2)

/** \\brief  Length for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_OFF (3)

/** \\brief  Length for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_OFF (4)

/** \\brief  Length for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_OFF (5)

/** \\brief  Length for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_LEN (1)

/** \\brief  Mask for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_MSK (0x1)

