HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPort_bf.h
/** \\brief  Length for Ifx_P_LPCR2_P21_Bits.TX_PD */
#define IFX_P_LPCR2_P21_TX_PD_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_P21_Bits.TX_PD */
#define IFX_P_LPCR2_P21_TX_PD_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_P21_Bits.TX_PD */
#define IFX_P_LPCR2_P21_TX_PD_OFF (14)

/** \\brief  Length for Ifx_P_LPCR2_P21_Bits.TX_PWDPD */
#define IFX_P_LPCR2_P21_TX_PWDPD_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_P21_Bits.TX_PWDPD */
#define IFX_P_LPCR2_P21_TX_PWDPD_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_P21_Bits.TX_PWDPD */
#define IFX_P_LPCR2_P21_TX_PWDPD_OFF (15)

/** \\brief  Length for Ifx_P_LPCR2_Bits.PS1 */
#define IFX_P_LPCR2_PS1_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.PS1 */
#define IFX_P_LPCR2_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.PS1 */
#define IFX_P_LPCR2_PS1_OFF (1)

/** \\brief  Length for Ifx_P_LPCR3_Bits.PS1 */
#define IFX_P_LPCR3_PS1_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.PS1 */
#define IFX_P_LPCR3_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.PS1 */
#define IFX_P_LPCR3_PS1_OFF (1)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_OFF (16)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_OFF (17)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_OFF (18)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_OFF (19)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_OFF (28)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_OFF (29)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_OFF (30)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_OFF (31)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_OFF (20)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_OFF (21)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_OFF (22)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_OFF (23)

/** \\brief  Length for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_OFF (26)

/** \\brief  Length for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_OFF (27)

/** \\brief  Length for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_OFF (24)

/** \\brief  Length for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_OFF (25)

/** \\brief  Length for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_OFF (16)

/** \\brief  Length for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_OFF (26)

/** \\brief  Length for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_OFF (27)

/** \\brief  Length for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_LEN (1)

/** \\brief  Mask for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_MSK (0x1)

